src/InformationRegisters/НастройкиКонтроляРелизов/НастройкиКонтроляРелизов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиКонтроляРелизов</name>
  <resources>
    <name>КонтрольАктивен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ШаблонУведомления</name>
    <type>
      <types>CatalogRef.ШаблоныСообщений</types>
    </type>
  </resources>
  <resources>
    <name>РекомендуемыйСрокУстановкиВДнях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтправлятьПовторныеУведомления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ШаблонПовторногоУведомления</name>
    <type>
      <types>CatalogRef.ШаблоныСообщений</types>
    </type>
  </resources>
  <resources>
    <name>ИнтервалПовторныхУведомленийВДнях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаксимальноеКоличествоПовторов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОбъектаИБ</name>
    <type>
      <types>EnumRef.ТипыОбъектовИБ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектИБ</name>
    <type>
      <types>DefinedType.ОбъектИБ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СостоянияКонтроляРелизов/СостоянияКонтроляРелизов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияКонтроляРелизов</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСостояния</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОбнаруженияВерсии</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаКонтрольногоСрока</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПланируемойУстановки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнегоУведомления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоУведомлений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ИдентификаторСостояния</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПоследнегоУведомления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПринялРешение</name>
    <type>
      <types>CatalogRef.ОтветственныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючОбновления</name>
    <type>
      <types>CatalogRef.КлючиОбновлений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ВерсииКонфигурацийИБ/ВерсииКонфигурацийИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВерсииКонфигурацийИБ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Версия</name>
    <type>
      <types>CatalogRef.ВерсииКонфигураций</types>
    </type>
  </resources>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/УстановленныеПодсистемы/УстановленныеПодсистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УстановленныеПодсистемы</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Версия</name>
    <type>
      <types>CatalogRef.ВерсииПодсистем</types>
    </type>
  </resources>
  <resources>
    <name>Исключить</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подсистема</name>
    <type>
      <types>CatalogRef.Подсистемы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/УстановленныеРасширенияКонфигураций/УстановленныеРасширенияКонфигураций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УстановленныеРасширенияКонфигураций</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Версия</name>
    <type>
      <types>CatalogRef.ВерсииРасширенийКонфигураций</types>
    </type>
  </resources>
  <resources>
    <name>Исключить</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ХешСумма</name>
    <comment>SHA-1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Активно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Назначение</name>
    <type>
      <types>EnumRef.НазначенияРасширений</types>
    </type>
  </resources>
  <resources>
    <name>БезопасныйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Модифицировано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасширениеКонфигурации</name>
    <type>
      <types>CatalogRef.РасширенияКонфигураций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусыСостояния/СтатусыСостояния.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСостояния</name>
  <enumValues>
    <name>НоваяВерсияДоступна</name>
  </enumValues>
  <enumValues>
    <name>ОжидаениеРеакции</name>
  </enumValues>
  <enumValues>
    <name>ПланируетсяУстановка</name>
  </enumValues>
  <enumValues>
    <name>ПропущенРелиз</name>
  </enumValues>
  <enumValues>
    <name>Установлено</name>
  </enumValues>
  <enumValues>
    <name>Просрочено</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ТипыОбъектовИБ/ТипыОбъектовИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбъектовИБ</name>
  <enumValues>
    <name>Конфигурация</name>
  </enumValues>
  <enumValues>
    <name>Подсистема</name>
  </enumValues>
  <enumValues>
    <name>РасширениеКонфигурации</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СтатусыИнформационныхБаз/СтатусыИнформационныхБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыИнформационныхБаз</name>
  <enumValues>
    <name>Рабочая</name>
  </enumValues>
  <enumValues>
    <name>Тестовая</name>
  </enumValues>
  <enumValues>
    <name>Архивная</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <attributes>
    <name>ИдентификаторИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонфигурации</name>
    <type>
      <types>CatalogRef.ВидыКонфигураций</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>CatalogRef.ВерсииКонфигураций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРазмещения</name>
    <type>
      <types>EnumRef.ВариантыРазмещенияИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПоддержки</name>
    <type>
      <types>EnumRef.СтатусыПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИБ</name>
    <type>
      <types>EnumRef.СтатусыИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКаталогИБ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверИБ</name>
    <type>
      <types>CatalogRef.Серверы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСУБД</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверСУБД</name>
    <type>
      <types>CatalogRef.Серверы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияТехнологическойПлатформы</name>
    <type>
      <types>CatalogRef.ВерсииТехнологическойПлатформы</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонУведомленияПодключение</name>
    <type>
      <types>CatalogRef.ШаблоныСообщений</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ВерсииКонфигураций/ВерсииКонфигураций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВерсииКонфигураций</name>
  <attributes>
    <name>ВидКонфигурации</name>
    <type>
      <types>CatalogRef.ВидыКонфигураций</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>CatalogRef.РедакцииКонфигураций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РелизОтозван</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>URLИнфо</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/КонтрольРелизов/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает таблицу значений с текущими и актуальными версиями конфигураций, подсистем и расширений для всех информационных баз с активными настройками контроля релизов.
//
// Параметры:
// Отсутствуют
//
// Возвращаемое значение:
// ТаблицаЗначений - содержит колонки: 
//	ИнформационнаяБаза (СправочникСсылка.ИнформационныеБазы), 
//	ТипОбъектаИБ (ПеречислениеСсылка.ТипыОбъектовИБ), 
//	ОбъектИБ (СправочникСсылка), 
//	ТекущаяВерсия (Версия), 
//	ктуальнаяВерсия (СправочникСсылка), 
//	РекомендуемыйСрокУстановкиВДнях (Число)
//
Функция ПолучитьТаблицуСостоянийВерсий() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаБазовыеДанные();
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Возвращает настройки контроля релизов для указанной информационной базы.
//
// Параметры:
// ИнформационнаяБаза - СправочникСсылка.ИнформационныеБазы - ссылка на информационную базу
// ТипОбъектаИБ - ПеречислениеСсылка.ТипыОбъектовИБ, Неопределено - опциональный фильтр по типу объекта ИБ (конфигурация, подсистема, расширение конфигурации)
//
// Возвращаемое значение:
// ТаблицаЗначений - содержит колонки: 
//	ТипОбъектаИБ, ОбъектИБ, 
//	КонтрольАктивен (Булево), 
//	ШаблонУведомления (СправочникСсылка), 
//	РекомендуемыйСрокУстановкиВДнях (Число), 
//	ОтправлятьПовторныеУведомления (Булево), 
//	ШаблонПовторногоУведомления (СправочникСсылка), 
//	ИнтервалПовторныхУведомленийВДнях (Число), 
//	МаксимальноеКоличествоПовторов (Число)
//
Функция ПолучитьНастройкиИБ(ИнформационнаяБаза, ТипОбъектаИБ = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Настройки.ТипОбъектаИБ КАК ТипОбъектаИБ,
		|	Настройки.ОбъектИБ КАК ОбъектИБ,
		|	Настройки.КонтрольАктивен КАК КонтрольАктивен,
		|	Настройки.ШаблонУведомления КАК ШаблонУведомления,
		|	Настройки.РекомендуемыйСрокУстановкиВДнях КАК РекомендуемыйСрокУстановкиВДнях,
		|	Настройки.ОтправлятьПовторныеУведомления КАК ОтправлятьПовторныеУведомления,
		|	Настройки.ШаблонПовторногоУведомления КАК ШаблонПовторногоУведомления,
		|	Настройки.ИнтервалПовторныхУведомленийВДнях КАК ИнтервалПовторныхУведомленийВДнях,
		|	Настройки.МаксимальноеКоличествоПовторов КАК МаксимальноеКоличествоПовторов
		|ИЗ
		|	РегистрСведений.НастройкиКонтроляРелизов КАК Настройки
		|ГДЕ
		|	Настройки.ИнформационнаяБаза = &ИнформационнаяБаза
		|	И (&ТипОбъектаИБ = НЕОПРЕДЕЛЕНО
		|			ИЛИ Настройки.ТипОбъектаИБ = &ТипОбъектаИБ)"; 
	
	Запрос.УстановитьПараметр("ИнформационнаяБаза", ИнформационнаяБаза);
	Запрос.УстановитьПараметр("ТипОбъектаИБ", ТипОбъектаИБ);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Записывает настройки контроля релизов для указанной информационной базы.
//
// Параметры:
// Настройки - ТаблицаЗначений - таблица со строками настроек контроля релизов
// ИнформационнаяБаза - СправочникСсылка.ИнформационныеБазы - ссылка на информационную базу, для которой записываются настройки
//
// Возвращаемое значение:
// Отсутствует
//
Процедура ЗаписатьНастройкиИБ(Настройки, ИнформационнаяБаза) Экспорт
	
	Набор = РегистрыСведений.НастройкиКонтроляРелизов.СоздатьНаборЗаписей();
	Набор.Отбор.ИнформационнаяБаза.Установить(ИнформационнаяБаза);
	
	Для Каждого СтрокаНастройки Из Настройки Цикл
		Запись = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, СтрокаНастройки);
		Запись.ИнформационнаяБаза = ИнформационнаяБаза;
	КонецЦикла;
	
	Набор.Записать(Истина);
	
КонецПроцедуры

// Выполняет актуализацию состояний контроля релизов для информационных баз по указанным типам обработки.
//
// Параметры:
// ТипыОбработки - Массив, Неопределено - массив строк с типами обработки: "Расхождения", "Установленные", "Просроченные", "Устаревшие". Если не задан, выполняются все типы обработки.
//
// Возвращаемое значение:
// Отсутствует
//
Процедура АктуализацияСостоянийРелизовИБ(ТипыОбработки = Неопределено) Экспорт
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	ТаблицаВерсий = ПолучитьТаблицуСостоянийВерсий();	
	Если ТаблицаВерсий.Количество() = 0 Тогда
		Возврат; 
	КонецЕсли;
	
	Если ТипыОбработки = Неопределено Тогда
		ТипыОбработки = Новый Массив;
		ТипыОбработки.Добавить("Расхождения");
		ТипыОбработки.Добавить("Установленные");
		ТипыОбработки.Добавить("Просроченные");
		ТипыОбработки.Добавить("Устаревшие");
	КонецЕсли;
	
	Для Каждого Тип Из ТипыОбработки Цикл
		Если Тип = "Расхождения" Тогда
			ОбработатьРасхождения(ТаблицаВерсий, ТекущаяДата);
		ИначеЕсли Тип = "Установленные" Тогда
			ОбработатьУстановленные(ТаблицаВерсий);
		ИначеЕсли Тип = "Просроченные" Тогда
			ОбработатьПросроченные(ТекущаяДата);
		ИначеЕсли Тип = "Устаревшие" Тогда
			ОбработатьУстаревшие();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики

Процедура ОбработатьРасхождения(ТаблицаВерсий, ТекущаяДата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаВыборкаРасхождений();
	Запрос.УстановитьПараметр("ТаблицаВерсий", ТаблицаВерсий);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Если Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьТаблицуРасхождений(Таблица, ТекущаяДата);
	
КонецПроцедуры

Процедура ОбработатьУстановленные(ТаблицаВерсий)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаВыборкаУстановленных();
	Запрос.УстановитьПараметр("ТаблицаВерсий", ТаблицаВерсий);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Если Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьТаблицуУстановленных(Таблица);
	
КонецПроцедуры

Процедура ОбработатьПросроченные(ТекущаяДата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПросроченныеСостояния(); 
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Если Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьТаблицуПросроченных(Таблица);
	
КонецПроцедуры

Процедура ОбработатьУстаревшие()
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаУстаревшиеОбновления();
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Если Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьТаблицуУстаревших(Таблица);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаТаблиц

// Обрабатывает таблицу расхождений между текущими и актуальными версиями объектов информационных баз.
// Для каждой найденной записи создает новую запись в регистре "СостоянияКонтроляРелизов" со статусом "ПланируетсяУстановка".
// Запись создается только если не существует записи с таким же ключом обновления.
// Устанавливает дату обнаружения, контрольный срок (текущая дата + рекомендуемый срок установки), счетчик уведомлений = 0 и генерирует уникальный идентификатор состояния.
//
// Параметры:
// Таблица - ТаблицаЗначений - таблица с расхождениями, содержащая колонки: ИнформационнаяБаза, ТипОбъектаИБ, ОбъектИБ, ТекущаяВерсия, АктуальнаяВерсия, РекомендуемыйСрокУстановкиВДнях
// ДатаОбнаружения - Дата - дата, когда было обнаружено расхождение (обычно текущая дата сеанса)
//
// Возвращаемое значение:
// Отсутствует
//
Процедура ОбработатьТаблицуРасхождений(Таблица, ДатаОбнаружения)
	
	УникальныеИБ = Таблица.Скопировать(, "ИнформационнаяБаза");
	УникальныеИБ.Свернуть("ИнформационнаяБаза");
	
	Для Каждого СтрокаИБ Из УникальныеИБ Цикл
		
		ИнформационнаяБаза = СтрокаИБ.ИнформационнаяБаза;
		СтрокиПоИБ = Таблица.НайтиСтроки(Новый Структура("ИнформационнаяБаза", ИнформационнаяБаза));
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СостоянияКонтроляРелизов");
			ЭлементБлокировки.УстановитьЗначение("ИнформационнаяБаза", ИнформационнаяБаза);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			Для Каждого Строка Из СтрокиПоИБ Цикл
				
				КлючОбновления = КлючиОбновлений.ПолучитьЭлемент(
					Строка.ИнформационнаяБаза, 
					Строка.ТипОбъектаИБ, 
					Строка.ОбъектИБ, 
					Строка.ТекущаяВерсия, 
					Строка.АктуальнаяВерсия
				);
				
				НаборЗаписей = РегистрыСведений.СостоянияКонтроляРелизов.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ИнформационнаяБаза.Установить(ИнформационнаяБаза);
				НаборЗаписей.Отбор.КлючОбновления.Установить(КлючОбновления);
				НаборЗаписей.Прочитать();
				
				Если НаборЗаписей.Количество() > 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Запись = НаборЗаписей.Добавить();
				Запись.ИнформационнаяБаза = Строка.ИнформационнаяБаза;
				Запись.КлючОбновления = КлючОбновления;
				Запись.Статус = Перечисления.СтатусыСостояния.ПланируетсяУстановка;
				Запись.ДатаОбнаруженияВерсии = ДатаОбнаружения;
				Запись.ДатаКонтрольногоСрока = ДатаОбнаружения + Строка.РекомендуемыйСрокУстановкиВДнях * 86400;
				Запись.КоличествоУведомлений = 0;
				Запись.ИдентификаторСостояния = Строка(Новый УникальныйИдентификатор);
				Запись.Комментарий = "Обнаружено автоматически регламентным заданием";
				
				НаборЗаписей.Записать(Истина);
				
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации("КонтрольРелизов.ОбработкаРасхождения", УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// Обрабатывает таблицу установленных версий объектов информационных баз.
// Для каждой записи в таблице находит соответствующую запись в регистре "СостоянияКонтроляРелизов" по ключу обновления и изменяет её статус на "Установлено".
// Обновление применяется только к записям со статусами "ПланируетсяУстановка" или "Просрочено".
// Добавляется комментарий "Установлено автоматически регламентным заданием".
//
// Параметры:
// Таблица - ТаблицаЗначений - таблица с установленными версиями, содержащая колонки: ИнформационнаяБаза, КлючОбновления
//
// Возвращаемое значение:
// Отсутствует
//
Процедура ОбработатьТаблицуУстановленных(Таблица)
	
	УникальныеИБ = Таблица.Скопировать(, "ИнформационнаяБаза");
	УникальныеИБ.Свернуть("ИнформационнаяБаза");
	
	Для Каждого СтрокаИБ Из УникальныеИБ Цикл
		
		ИнформационнаяБаза = СтрокаИБ.ИнформационнаяБаза;
		СтрокиПоИБ = Таблица.НайтиСтроки(Новый Структура("ИнформационнаяБаза", ИнформационнаяБаза));
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СостоянияКонтроляРелизов");
			ЭлементБлокировки.УстановитьЗначение("ИнформационнаяБаза", ИнформационнаяБаза);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			Для Каждого Строка Из СтрокиПоИБ Цикл
				
				НаборЗаписей = РегистрыСведений.СостоянияКонтроляРелизов.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ИнформационнаяБаза.Установить(ИнформационнаяБаза);
				НаборЗаписей.Отбор.КлючОбновления.Установить(Строка.КлючОбновления);
				НаборЗаписей.Прочитать();
				
				Если НаборЗаписей.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Для Каждого Запись Из НаборЗаписей Цикл
					Запись.Статус = Перечисления.СтатусыСостояния.Установлено;
					Запись.Комментарий = "Установлено автоматически регламентным заданием";
				КонецЦикла;
				
				НаборЗаписей.Записать(Истина);
				
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации("КонтрольРелизов.ОбработкаУстановленные", УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// Обрабатывает таблицу просроченных состояний контроля релизов.
// Для каждой записи в таблице находит соответствующую запись в регистре "СостоянияКонтроляРелизов" и изменяет статус с "ПланируетсяУстановка" на "Просрочено".
// Обработка выполняется только для записей, у которых дата контрольного срока меньше текущей даты.
// Работа выполняется в транзакции с блокировкой данных по информационной базе.
//
// Параметры:
// Таблица - ТаблицаЗначений - таблица с просроченными состояниями, содержащая колонки: ИнформационнаяБаза, КлючОбновления
//
// Возвращаемое значение:
// Отсутствует
//
Процедура ОбработатьТаблицуПросроченных(Таблица)
	
	УникальныеИБ = Таблица.Скопировать(, "ИнформационнаяБаза");
	УникальныеИБ.Свернуть("ИнформационнаяБаза");
	
	Для Каждого СтрокаИБ Из УникальныеИБ Цикл
		
		ИнформационнаяБаза = СтрокаИБ.ИнформационнаяБаза;
		СтрокиПоИБ = Таблица.НайтиСтроки(Новый Структура("ИнформационнаяБаза", ИнформационнаяБаза));
		
		НачатьТранзакцию();
		Попытка
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СостоянияКонтроляРелизов");
			ЭлементБлокировки.УстановитьЗначение("ИнформационнаяБаза", ИнформационнаяБаза);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			Для Каждого Строка Из СтрокиПоИБ Цикл
				НаборЗаписей = РегистрыСведений.СостоянияКонтроляРелизов.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ИнформационнаяБаза.Установить(ИнформационнаяБаза);
				НаборЗаписей.Отбор.КлючОбновления.Установить(Строка.КлючОбновления);
				НаборЗаписей.Прочитать();
				
				Для Каждого Запись Из НаборЗаписей Цикл
					Если Запись.Статус = Перечисления.СтатусыСостояния.ПланируетсяУстановка Тогда
						Запись.Статус = Перечисления.СтатусыСостояния.Просрочено;
					КонецЕсли;
				КонецЦикла;
				
				Если НаборЗаписей.Модифицированность() Тогда
					НаборЗаписей.Записать(Истина);
				КонецЕсли;
			КонецЦикла;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации("КонтрольРелизов.ОбработкаПросроченные", УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

// Обрабатывает таблицу устаревших обновлений объектов информационных баз.
// Для каждой записи в таблице находит соответствующую запись в регистре "СостоянияКонтроляРелизов" и изменяет статус на "ПропущенРелиз".
// Обработка применяется только к записям со статусами, отличными от "Установлено" и "ПропущенРелиз".
// Это происходит когда для объекта обнаружена более новая версия, которая вытесняет предыдущую.
// Добавляется комментарий "Вытеснено более новым релизом в рамках объекта".
//
// Параметры:
// Таблица - ТаблицаЗначений - таблица с устаревшими обновлениями, содержащая колонки: ИнформационнаяБаза, КлючОбновления
//
// Возвращаемое значение:
// Отсутствует
//
Процедура ОбработатьТаблицуУстаревших(Таблица)
	
	УникальныеИБ = Таблица.Скопировать(, "ИнформационнаяБаза");
	УникальныеИБ.Свернуть("ИнформационнаяБаза");
	
	Для Каждого СтрокаИБ Из УникальныеИБ Цикл
		ИнформационнаяБаза = СтрокаИБ.ИнформационнаяБаза;
		СтрокиПоИБ = Таблица.НайтиСтроки(Новый Структура("ИнформационнаяБаза", ИнформационнаяБаза));
		
		НачатьТранзакцию();
		Попытка
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СостоянияКонтроляРелизов");
			ЭлементБлокировки.УстановитьЗначение("ИнформационнаяБаза", ИнформационнаяБаза);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			Для Каждого Строка Из СтрокиПоИБ Цикл
				НаборЗаписей = РегистрыСведений.СостоянияКонтроляРелизов.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ИнформационнаяБаза.Установить(ИнформационнаяБаза);
				НаборЗаписей.Отбор.КлючОбновления.Установить(Строка.КлючОбновления);
				НаборЗаписей.Прочитать();
				
				Для Каждого Запись Из НаборЗаписей Цикл
					Если Запись.Статус <> Перечисления.СтатусыСостояния.Установлено
						И Запись.Статус <> Перечисления.СтатусыСостояния.ПропущенРелиз Тогда
						Запись.Статус = Перечисления.СтатусыСостояния.ПропущенРелиз;
						Запись.Комментарий = "Вытеснено более новым релизом в рамках объекта";
					КонецЕсли;
				КонецЦикла;
				
				Если НаборЗаписей.Модифицированность() Тогда
					НаборЗаписей.Записать(Истина);
				КонецЕсли;
			КонецЦикла;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации("КонтрольРелизов.ОбработкаУстаревшие", УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеФункции

Функция ПолучитьПараметрыАктуализации()
	
	Параметры = Новый Структура;
	Параметры.Вставить("ТекущаяДата", ТекущаяДатаСеанса());
	
	ОткрытыеСтатусы = Новый Массив;
	ОткрытыеСтатусы.Добавить(Перечисления.СтатусыСостояния.ПланируетсяУстановка);
	ОткрытыеСтатусы.Добавить(Перечисления.СтатусыСостояния.Просрочено);
	Параметры.Вставить("ОткрытыеСтатусы", ОткрытыеСтатусы);
	
	Параметры.Вставить("ТипКонфигурация", Перечисления.ТипыОбъектовИБ.Конфигурация);
	Параметры.Вставить("ТипПодсистема", Перечисления.ТипыОбъектовИБ.Подсистема);
	Параметры.Вставить("ТипРасширениеКонфигурации", Перечисления.ТипыОбъектовИБ.РасширениеКонфигурации);
	
	Параметры.Вставить("СтатусРабочая", Перечисления.СтатусыИнформационныхБаз.Рабочая);
	Параметры.Вставить("СтатусПланируетсяУстановка", Перечисления.СтатусыСостояния.ПланируетсяУстановка);
	Параметры.Вставить("СтатусУстановлено", Перечисления.СтатусыСостояния.Установлено);
	Параметры.Вставить("СтатусПропущенРелиз", Перечисления.СтатусыСостояния.ПропущенРелиз);
	
	Возврат Параметры;
	
КонецФункции

Процедура ЗаполнитьПараметрыЗапроса(Запрос, Параметры)
	Для Каждого КлючИЗначение Из Параметры Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ТекстыЗапросов

Функция ТекстЗапросаБазовыеДанные()
	
	Возврат
		"ВЫБРАТЬ
		|	Настройки.ИнформационнаяБаза КАК ИнформационнаяБаза,
		|	Настройки.ТипОбъектаИБ КАК ТипОбъектаИБ,
		|	Настройки.ОбъектИБ КАК ОбъектИБ,
		|	Настройки.РекомендуемыйСрокУстановкиВДнях КАК РекомендуемыйСрокУстановкиВДнях
		|ПОМЕСТИТЬ ВТ_АктивныеНастройки
		|ИЗ
		|	РегистрСведений.НастройкиКонтроляРелизов КАК Настройки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнформационныеБазы КАК ИБ
		|		ПО Настройки.ИнформационнаяБаза = ИБ.Ссылка
		|ГДЕ
		|	Настройки.КонтрольАктивен
		|	И ИБ.СтатусИБ = ЗНАЧЕНИЕ(Перечисление.СтатусыИнформационныхБаз.Рабочая)
		|	И Настройки.ТипОбъектаИБ В (ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовИБ.Конфигурация), ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовИБ.Подсистема), ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовИБ.РасширениеКонфигурации))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Настройки.ИнформационнаяБаза КАК ИнформационнаяБаза,
		|	Настройки.ТипОбъектаИБ КАК ТипОбъектаИБ,
		|	Настройки.ОбъектИБ КАК ОбъектИБ,
		|	ВерсииИБ.Версия КАК ТекущаяВерсия,
		|	МАКСИМУМ(АктуальныеВерсии.Ссылка) КАК АктуальнаяВерсия,
		|	Настройки.РекомендуемыйСрокУстановкиВДнях КАК РекомендуемыйСрокУстановкиВДнях
		|ИЗ
		|	ВТ_АктивныеНастройки КАК Настройки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВерсииКонфигурацийИБ.СрезПоследних КАК ВерсииИБ
		|		ПО Настройки.ИнформационнаяБаза = ВерсииИБ.ИнформационнаяБаза
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнформационныеБазы КАК ИБ
		|		ПО Настройки.ИнформационнаяБаза = ИБ.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВК.ВидКонфигурации КАК ВидКонфигурации,
		|			ВК.Редакция КАК Редакция,
		|			МАКСИМУМ(ВК.ДатаВыхода) КАК МаксДата
		|		ИЗ
		|			Справочник.ВерсииКонфигураций КАК ВК
		|		ГДЕ
		|			НЕ ВК.РелизОтозван
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВК.ВидКонфигурации,
		|			ВК.Редакция) КАК МаксДатыКонф
		|		ПО (Настройки.ТипОбъектаИБ = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовИБ.Конфигурация))
		|			И (ИБ.ВидКонфигурации = МаксДатыКонф.ВидКонфигурации)
		|			И (ВерсииИБ.Версия.Редакция = МаксДатыКонф.Редакция)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВерсииКонфигураций КАК АктуальныеВерсии
		|		ПО (МаксДатыКонф.ВидКонфигурации = АктуальныеВерсии.ВидКонфигурации)
		|			И (МаксДатыКонф.Редакция = АктуальныеВерсии.Редакция)
		|			И (МаксДатыКонф.МаксДата = АктуальныеВерсии.ДатаВыхода)
		|			И (НЕ АктуальныеВерсии.РелизОтозван)
		|ГДЕ
		|	Настройки.ТипОбъектаИБ = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовИБ.Конфигурация)
		|
		|СГРУППИРОВАТЬ ПО
		|	Настройки.ИнформационнаяБаза,
		|	Настройки.ТипОбъектаИБ,
		|	Настройки.ОбъектИБ,
		|	ВерсииИБ.Версия,
		|	Настройки.РекомендуемыйСрокУстановкиВДнях
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Настройки.ИнформационнаяБаза,
		|	Настройки.ТипОбъектаИБ,
		|	Настройки.ОбъектИБ,
		|	УстПодсистемы.Версия,
		|	МАКСИМУМ(АктуальныеВерсииП.Ссылка),
		|	Настройки.РекомендуемыйСрокУстановкиВДнях
		|ИЗ
		|	ВТ_АктивныеНастройки КАК Настройки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УстановленныеПодсистемы КАК УстПодсистемы
		|		ПО Настройки.ИнформационнаяБаза = УстПодсистемы.ИнформационнаяБаза
		|			И Настройки.ОбъектИБ = УстПодсистемы.Подсистема
		|			И (НЕ УстПодсистемы.Исключить)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВерсииПодсистем КАК АктуальныеВерсииП
		|		ПО Настройки.ОбъектИБ = АктуальныеВерсииП.Подсистема
		|ГДЕ
		|	Настройки.ТипОбъектаИБ = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовИБ.Подсистема)
		|
		|СГРУППИРОВАТЬ ПО
		|	Настройки.ИнформационнаяБаза,
		|	Настройки.ТипОбъектаИБ,
		|	Настройки.ОбъектИБ,
		|	УстПодсистемы.Версия,
		|	Настройки.РекомендуемыйСрокУстановкиВДнях
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Настройки.ИнформационнаяБаза,
		|	Настройки.ТипОбъектаИБ,
		|	Настройки.ОбъектИБ,
		|	УстРасширения.Версия,
		|	МАКСИМУМ(АктуальныеВерсииР.Ссылка),
		|	Настройки.РекомендуемыйСрокУстановкиВДнях
		|ИЗ
		|	ВТ_АктивныеНастройки КАК Настройки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УстановленныеРасширенияКонфигураций КАК УстРасширения
		|		ПО Настройки.ИнформационнаяБаза = УстРасширения.ИнформационнаяБаза
		|			И Настройки.ОбъектИБ = УстРасширения.РасширениеКонфигурации
		|			И (НЕ УстРасширения.Исключить)
		|			И (УстРасширения.Активно)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВР.Расширение КАК Расширение,
		|			МАКСИМУМ(ВР.ДатаВыхода) КАК МаксДата
		|		ИЗ
		|			Справочник.ВерсииРасширенийКонфигураций КАК ВР
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВР.Расширение) КАК МаксДатыР
		|		ПО Настройки.ОбъектИБ = МаксДатыР.Расширение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВерсииРасширенийКонфигураций КАК АктуальныеВерсииР
		|		ПО (МаксДатыР.Расширение = АктуальныеВерсииР.Расширение)
		|			И (МаксДатыР.МаксДата = АктуальныеВерсииР.ДатаВыхода)
		|ГДЕ
		|	Настройки.ТипОбъектаИБ = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовИБ.РасширениеКонфигурации)
		|
		|СГРУППИРОВАТЬ ПО
		|	Настройки.ИнформационнаяБаза,
		|	Настройки.ТипОбъектаИБ,
		|	Настройки.ОбъектИБ,
		|	УстРасширения.Версия,
		|	Настройки.РекомендуемыйСрокУстановкиВДнях";

	

КонецФункции

Функция ТекстЗапросаВыборкаРасхождений()
	
	Возврат
		"ВЫБРАТЬ
		|	Т.ИнформационнаяБаза КАК ИнформационнаяБаза,
		|	Т.ТипОбъектаИБ КАК ТипОбъектаИБ,
		|	Т.ОбъектИБ КАК ОбъектИБ,
		|	Т.ТекущаяВерсия КАК ТекущаяВерсия,
		|	Т.АктуальнаяВерсия КАК АктуальнаяВерсия,
		|	Т.РекомендуемыйСрокУстановкиВДнях КАК РекомендуемыйСрокУстановкиВДнях
		|ПОМЕСТИТЬ ВТ_Версии
		|ИЗ
		|	&ТаблицаВерсий КАК Т
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Т.ИнформационнаяБаза,
		|	Т.ТипОбъектаИБ,
		|	Т.ОбъектИБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Версии.ИнформационнаяБаза КАК ИнформационнаяБаза,
		|	ВТ_Версии.ТипОбъектаИБ КАК ТипОбъектаИБ,
		|	ВТ_Версии.ОбъектИБ КАК ОбъектИБ,
		|	ВТ_Версии.ТекущаяВерсия КАК ТекущаяВерсия,
		|	ВТ_Версии.АктуальнаяВерсия КАК АктуальнаяВерсия,
		|	ВТ_Версии.РекомендуемыйСрокУстановкиВДнях КАК РекомендуемыйСрокУстановкиВДнях
		|ИЗ
		|	ВТ_Версии КАК ВТ_Версии
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиОбновлений КАК КлючиОбновлений
		|		ПО ВТ_Версии.ИнформационнаяБаза = КлючиОбновлений.ИнформационнаяБаза
		|			И ВТ_Версии.ТипОбъектаИБ = КлючиОбновлений.ТипОбъектаИБ
		|			И ВТ_Версии.ОбъектИБ = КлючиОбновлений.ОбъектИБ
		|			И ВТ_Версии.ТекущаяВерсия = КлючиОбновлений.ТекущаяВерсия
		|			И ВТ_Версии.АктуальнаяВерсия = КлючиОбновлений.НоваяВерсия
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияКонтроляРелизов КАК Состояния
		|		ПО ВТ_Версии.ИнформационнаяБаза = Состояния.ИнформационнаяБаза
		|			И (КлючиОбновлений.Ссылка = Состояния.КлючОбновления)
		|ГДЕ
		|	ВТ_Версии.ТекущаяВерсия <> ВТ_Версии.АктуальнаяВерсия
		|	И Состояния.КлючОбновления ЕСТЬ NULL";
	
КонецФункции

Функция ТекстЗапросаВыборкаУстановленных()
	
	Возврат
		"ВЫБРАТЬ
		|	Т.ИнформационнаяБаза КАК ИнформационнаяБаза,
		|	Т.ТипОбъектаИБ КАК ТипОбъектаИБ,
		|	Т.ОбъектИБ КАК ОбъектИБ,
		|	Т.ТекущаяВерсия КАК ТекущаяВерсия,
		|	Т.АктуальнаяВерсия КАК АктуальнаяВерсия
		|ПОМЕСТИТЬ ВТ_Версии
		|ИЗ
		|	&ТаблицаВерсий КАК Т
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Т.ИнформационнаяБаза,
		|	Т.ТипОбъектаИБ,
		|	Т.ОбъектИБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Состояния.ИнформационнаяБаза КАК ИнформационнаяБаза,
		|	Состояния.КлючОбновления КАК КлючОбновления
		|ИЗ
		|	РегистрСведений.СостоянияКонтроляРелизов КАК Состояния
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Версии КАК ВТ_Версии
		|		ПО Состояния.ИнформационнаяБаза = ВТ_Версии.ИнформационнаяБаза
		|			И Состояния.КлючОбновления.ТипОбъектаИБ = ВТ_Версии.ТипОбъектаИБ
		|			И Состояния.КлючОбновления.ОбъектИБ = ВТ_Версии.ОбъектИБ
		|			И Состояния.КлючОбновления.НоваяВерсия = ВТ_Версии.ТекущаяВерсия
		|ГДЕ
		|	Состояния.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыСостояния.ПланируетсяУстановка), ЗНАЧЕНИЕ(Перечисление.СтатусыСостояния.Просрочено))";
	
КонецФункции

Функция ТекстЗапросаПросроченныеСостояния()
	
	Возврат
		"ВЫБРАТЬ
		|	Состояния.ИнформационнаяБаза КАК ИнформационнаяБаза,
		|	Состояния.КлючОбновления КАК КлючОбновления
		|ИЗ
		|	РегистрСведений.СостоянияКонтроляРелизов КАК Состояния
		|ГДЕ
		|	Состояния.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСостояния.ПланируетсяУстановка)
		|	И Состояния.ДатаКонтрольногоСрока < &ТекущаяДата";

КонецФункции

Функция ТекстЗапросаУстаревшиеОбновления()
	
	Возврат
		"ВЫБРАТЬ
		|	Состояния.ИнформационнаяБаза КАК ИнформационнаяБаза,
		|	Состояния.КлючОбновления.ТипОбъектаИБ КАК ТипОбъектаИБ,
		|	Состояния.КлючОбновления.ОбъектИБ КАК ОбъектИБ,
		|	МАКСИМУМ(Состояния.ДатаОбнаруженияВерсии) КАК МаксДатаОбнаружения
		|ПОМЕСТИТЬ ВТ_ПоследниеДаты
		|ИЗ
		|	РегистрСведений.СостоянияКонтроляРелизов КАК Состояния
		|ГДЕ
		|	Состояния.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСостояния.Установлено)
		|	И Состояния.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСостояния.ПропущенРелиз)
		|
		|СГРУППИРОВАТЬ ПО
		|	Состояния.ИнформационнаяБаза,
		|	Состояния.КлючОбновления.ТипОбъектаИБ,
		|	Состояния.КлючОбновления.ОбъектИБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Состояния.ИнформационнаяБаза КАК ИнформационнаяБаза,
		|	Состояния.КлючОбновления КАК КлючОбновления,
		|	Состояния.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СостоянияКонтроляРелизов КАК Состояния
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоследниеДаты КАК ВТ_ПоследниеДаты
		|		ПО Состояния.ИнформационнаяБаза = ВТ_ПоследниеДаты.ИнформационнаяБаза
		|			И Состояния.КлючОбновления.ТипОбъектаИБ = ВТ_ПоследниеДаты.ТипОбъектаИБ
		|			И Состояния.КлючОбновления.ОбъектИБ = ВТ_ПоследниеДаты.ОбъектИБ
		|			И Состояния.ДатаОбнаруженияВерсии < ВТ_ПоследниеДаты.МаксДатаОбнаружения
		|ГДЕ
		|	Состояния.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСостояния.Установлено)
		|	И Состояния.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСостояния.ПропущенРелиз)";
		
КонецФункции 

#КонецОбласти
